; domain
; move precondition updated to prevent moving from and to the same location
(define (domain briefcase)
(:requirements :typing :negative-preconditions :conditional-effects)
(:types portable location)
(:predicates (at ?y - portable ?x - location)
             (in ?x - portable)
             (is-at ?x - location))


(:action move
  :parameters (?m ?l - location)
  :precondition  (and (is-at ?m)(not (is-at ?l)))
  :effect (and (is-at ?l) (not (is-at ?m))
		    (forall (?x - portable) (when (in ?x)
		      (and (at ?x ?l) (not (at ?x ?m)))))))

  (:action take-out
      :parameters (?x - portable)
      :precondition (in ?x)
      :effect (not (in ?x)))
      
  (:action put-in
      :parameters (?x - portable ?l - location)
      :precondition (and (not (in ?x)) (at ?x ?l) (is-at ?l))
      :effect (in ?x)))

; problem
(define (problem briefcase-o3)
(:domain briefcase)
(:objects l0 l1 l2 l3 - location
          o0 o1 o2 - portable)
(:init
(at o0 l0)
(at o1 l1)
(at o2 l1)
(is-at l0)
)
(:goal
(and
(at o0 l0)
(at o1 l0)
(at o2 l2)
(is-at l1)
)
)
)

; plan
1. (move l0 l1)
   deleted: (is-at l0)
   added: (is-at l1)
   goals met: 2 of 4
2. (put-in o2 l1)
   added: (in o2)
   goals met: 2 of 4
3. (put-in o1 l1)
   added: (in o1)
   goals met: 2 of 4
4. (move l1 l0)
   deleted: (is-at l1) (at o1 l1) (at o2 l1)
   added: (is-at l0) (at o1 l0) (at o2 l0)
   goals met: 2 of 4
5. (take-out o1)
   deleted: (in o1)
   goals met: 2 of 4
6. (move l0 l1)
   deleted: (is-at l0) (at o2 l0)
   added: (is-at l1) (at o2 l1)
   goals met: 3 of 4
7. (move l1 l2)
   deleted: (is-at l1) (at o2 l1)
   added: (is-at l2) (at o2 l2)
   goals met: 3 of 4
8. (take-out o2)
   deleted: (in o2)
   goals met: 3 of 4
9. (move l2 l1)
   deleted: (is-at l2)
   added: (is-at l1)
   goals met: 4 of 4
